{
  "planetsInSigns": {
    "Sun in Aries": "Your core identity is driven by pioneering spirit and a desire for action. You are likely energetic and assertive, always ready to lead the way.",
    "Sun in Taurus": "Your sense of self is rooted in stability, comfort, and material security. You value consistency and are often patient and determined in your pursuits.",
    "Sun in Gemini": "Your identity is expressed through communication, curiosity, and adaptability. You thrive on learning new things and connecting with diverse ideas.",
    "Sun in Cancer": "Your core being is deeply connected to emotions, nurturing, and home. You are likely sensitive, empathetic, and protective of those you care about.",
    "Sun in Leo": "Your identity shines through self-expression, creativity, and a need for recognition. You possess natural leadership qualities and a desire to inspire others.",
    "Sun in Virgo": "Your sense of self is found in service, analysis, and practical application. You are meticulous, detail-oriented, and strive for efficiency and improvement.",
    "Sun in Libra": "Your identity is centered on balance, harmony, and relationships. You seek fairness and diplomacy, often striving to create peace and beauty in your environment.",
    "Sun in Scorpio": "Your core being is intense, transformative, and deeply perceptive. You are drawn to uncovering hidden truths and possess strong emotional depth and resilience.",
    "Sun in Sagittarius": "Your identity is fueled by a quest for truth, adventure, and expansive knowledge. You are optimistic, philosophical, and always seeking new horizons.",
    "Sun in Capricorn": "Your sense of self is built on discipline, ambition, and practical achievement. You are responsible, structured, and driven to build lasting foundations.",
    "Sun in Aquarius": "Your identity is expressed through innovation, individuality, and humanitarian ideals. You are forward-thinking, unconventional, and value collective progress.",
    "Sun in Pisces": "Your core being is compassionate, imaginative, and deeply intuitive. You are sensitive, artistic, and often feel a strong connection to the spiritual realm.",

    "Moon in Aries": "Your emotional responses are quick, impulsive, and direct. You feel most secure when you can act independently and assert your needs.",
    "Moon in Taurus": "You find emotional security in stability, comfort, and familiar routines. Your feelings are steady and you seek tangible expressions of affection.",
    "Moon in Gemini": "Your emotions are expressed through communication and intellectual curiosity. You need mental stimulation to feel emotionally fulfilled and can adapt quickly to changing moods.",
    "Moon in Cancer": "You are deeply nurturing and find emotional safety in home and family. Your feelings are profound and you are highly empathetic to others' needs.",
    "Moon in Leo": "You express emotions dramatically and seek recognition for your feelings. You need to feel appreciated and loved to feel emotionally secure.",
    "Moon in Virgo": "Your emotional nature is practical and analytical, seeking order and efficiency in your feelings. You express care through acts of service and attention to detail.",
    "Moon in Libra": "You seek emotional balance and harmony in relationships. Your feelings are often influenced by others, and you strive for fairness and diplomacy in emotional exchanges.",
    "Moon in Scorpio": "Your emotional world is intense, private, and transformative. You feel deeply and are drawn to profound emotional experiences, often guarding your true feelings.",
    "Moon in Sagittarius": "You find emotional freedom in exploration, learning, and adventure. Your feelings are optimistic and you need space to grow and expand your horizons.",
    "Moon in Capricorn": "You find emotional security through discipline, responsibility, and achievement. Your emotions are often reserved, and you seek practical ways to manage your feelings.",
    "Moon in Aquarius": "Your emotional responses are detached and objective, valuing intellectual connection over intense personal feelings. You find security in being unique and contributing to groups.",
    "Moon in Pisces": "Your emotional nature is highly sensitive, empathetic, and compassionate. You absorb the feelings of others easily and find comfort in creative or spiritual pursuits.",

    "Mercury in Aries": "Your communication is direct, assertive, and quick-witted. You think on your feet and are not afraid to speak your mind, often initiating conversations.",
    "Mercury in Taurus": "Your thinking is practical, deliberate, and focused on tangible results. You communicate in a steady, calm manner, preferring well-thought-out ideas.",
    "Mercury in Gemini": "Your mind is agile, curious, and thrives on diverse information. You are a natural communicator, excellent at multitasking and connecting various ideas.",
    "Mercury in Cancer": "Your thought process is intuitive, empathetic, and influenced by emotions. You communicate with warmth and sensitivity, often recalling past experiences.",
    "Mercury in Leo": "Your communication is dramatic, confident, and expressive. You enjoy being the center of attention when speaking and convey ideas with flair.",
    "Mercury in Virgo": "Your mind is analytical, precise, and highly detail-oriented. You communicate clearly and practically, excelling at problem-solving and organization.",
    "Mercury in Libra": "Your thinking is balanced, diplomatic, and focused on fairness. You communicate gracefully, seeking consensus and considering all perspectives.",
    "Mercury in Scorpio": "Your mind is penetrating, investigative, and deeply perceptive. You communicate with intensity, often uncovering hidden motives and truths.",
    "Mercury in Sagittarius": "Your thinking is expansive, philosophical, and focused on broad concepts. You communicate with enthusiasm, seeking knowledge and sharing your insights.",
    "Mercury in Capricorn": "Your mind is structured, disciplined, and practical. You communicate with authority and precision, focusing on long-term goals and realistic plans.",
    "Mercury in Aquarius": "Your thinking is innovative, unconventional, and objective. You communicate unique ideas and thrive on intellectual discussions, often challenging norms.",
    "Mercury in Pisces": "Your mind is intuitive, imaginative, and highly empathetic. You communicate with sensitivity and creativity, often understanding unspoken feelings.",

    "Venus in Aries": "You express love and affection impulsively and directly. You are attracted to excitement and assertiveness in relationships, often taking the initiative.",
    "Venus in Taurus": "You express love through loyalty, sensuality, and material comfort. You seek stable and secure relationships, valuing beauty and pleasure.",
    "Venus in Gemini": "You express affection through communication, wit, and intellectual connection. You enjoy variety in relationships and are attracted to stimulating conversations.",
    "Venus in Cancer": "You express love through nurturing, emotional security, and deep care. You are highly devoted in relationships and seek a strong sense of belonging.",
    "Venus in Leo": "You express affection dramatically and generously, seeking admiration and appreciation in return. You are attracted to confident and expressive partners.",
    "Venus in Virgo": "You express love through practical service, attention to detail, and helpfulness. You show affection by being reliable and supportive, often in understated ways.",
    "Venus in Libra": "You express love through harmony, balance, and partnership. You seek equality and beauty in relationships, valuing diplomacy and shared experiences.",
    "Venus in Scorpio": "You express love with intense passion, loyalty, and a desire for deep intimacy. You are drawn to transformative relationships and profound emotional bonds.",
    "Venus in Sagittarius": "You express affection through adventure, shared ideals, and intellectual freedom. You seek partners who can explore and grow with you, valuing honesty and optimism.",
    "Venus in Capricorn": "You express love with seriousness, commitment, and a practical approach. You seek stable, long-term relationships and are attracted to ambition and reliability.",
    "Venus in Aquarius": "You express affection in unconventional and intellectual ways, valuing friendship and shared ideals. You seek unique connections and freedom within relationships.",
    "Venus in Pisces": "You express love with boundless compassion, idealism, and deep empathy. You are drawn to spiritual connections and often idealize your partners.",

    "Mars in Aries": "Your drive and energy are direct, assertive, and pioneering. You act on impulse and are highly competitive, always ready to take the lead.",
    "Mars in Taurus": "Your drive is strong, persistent, and focused on building security. You act deliberately and with great endurance, valuing tangible results.",
    "Mars in Gemini": "Your energy is expressed through mental activity, communication, and versatility. You are driven by curiosity and can pursue multiple interests simultaneously.",
    "Mars in Cancer": "Your drive is protective, emotional, and often expressed indirectly. You are motivated by a need for security and defend your loved ones fiercely.",
    "Mars in Leo": "Your energy is expressed creatively, dramatically, and with a desire for recognition. You are driven to lead and inspire, acting with confidence and flair.",
    "Mars in Virgo": "Your drive is analytical, precise, and focused on improvement. You act with meticulous attention to detail and are motivated by a desire for efficiency and service.",
    "Mars in Libra": "Your energy is directed towards achieving balance, fairness, and harmonious relationships. You act diplomatically, seeking justice and cooperation.",
    "Mars in Scorpio": "Your drive is intense, strategic, and deeply transformative. You act with powerful determination, pursuing your goals with unwavering focus and passion.",
    "Mars in Sagittarius": "Your energy is expansive, adventurous, and driven by a quest for truth. You act with optimism and enthusiasm, seeking new experiences and knowledge.",
    "Mars in Capricorn": "Your drive is disciplined, ambitious, and focused on practical achievement. You act with strategic planning and perseverance, aiming for long-term success.",
    "Mars in Aquarius": "Your energy is expressed innovatively, independently, and for collective causes. You are driven by a desire for social change and act in unconventional ways.",
    "Mars in Pisces": "Your drive is subtle, compassionate, and often expressed through creative or spiritual channels. You act with empathy and intuition, sometimes lacking direct assertiveness.",

    "Jupiter in Aries": "Your growth and luck come through pioneering new paths and taking bold action. You are optimistic and find opportunity by being courageous and initiating.",
    "Jupiter in Taurus": "Your expansion and good fortune are found in stability, material accumulation, and practical values. You thrive by building solid foundations and appreciating abundance.",
    "Jupiter in Gemini": "Your growth comes through learning, communication, and diverse connections. You find luck in intellectual pursuits and sharing information widely.",
    "Jupiter in Cancer": "Your expansion and good fortune are linked to home, family, and emotional security. You find abundance through nurturing others and building strong emotional bonds.",
    "Jupiter in Leo": "Your growth is amplified through creative self-expression, leadership, and generosity. You find luck by confidently sharing your talents and inspiring others.",
    "Jupiter in Virgo": "Your expansion comes through meticulous work, service, and continuous improvement. You find good fortune by being organized, analytical, and helpful.",
    "Jupiter in Libra": "Your growth is found in harmonious relationships, diplomacy, and seeking justice. You find luck through partnerships and creating balance in your life.",
    "Jupiter in Scorpio": "Your expansion comes through deep transformation, shared resources, and uncovering hidden truths. You find good fortune by embracing intensity and profound change.",
    "Jupiter in Sagittarius": "Your growth is natural through travel, higher education, and philosophical exploration. You are inherently lucky when pursuing knowledge and adventure.",
    "Jupiter in Capricorn": "Your expansion and good fortune are achieved through discipline, hard work, and responsible ambition. You find success by building solid structures and demonstrating integrity.",
    "Jupiter in Aquarius": "Your growth comes through innovation, humanitarian efforts, and unique social connections. You find luck by embracing originality and contributing to collective ideals.",
    "Jupiter in Pisces": "Your expansion is found in compassion, spirituality, and creative imagination. You find good fortune through empathy, intuition, and selfless service.",

    "Saturn in Aries": "You learn discipline through asserting your independence and initiating action. Challenges arise in self-assertion, requiring you to develop patience and strategic planning.",
    "Saturn in Taurus": "Your lessons in discipline involve material security, self-worth, and building stable foundations. You learn responsibility through managing resources and establishing lasting values.",
    "Saturn in Gemini": "Your challenges involve disciplined thinking, clear communication, and overcoming mental restlessness. You learn responsibility through focused study and effective expression.",
    "Saturn in Cancer": "Your lessons in discipline are centered on emotional security, family foundations, and nurturing. You learn responsibility through managing your feelings and building secure domestic life.",
    "Saturn in Leo": "Your challenges involve disciplined self-expression, leadership, and creative endeavors. You learn responsibility through humble leadership and authentic self-mastery.",
    "Saturn in Virgo": "Your lessons in discipline involve meticulous work, health routines, and practical service. You learn responsibility through attention to detail and efficient systems.",
    "Saturn in Libra": "Your challenges involve disciplined relationships, fairness, and achieving balance. You learn responsibility through committed partnerships and seeking true justice.",
    "Saturn in Scorpio": "Your lessons in discipline are centered on transformation, shared resources, and emotional intensity. You learn responsibility through managing power and deep psychological processes.",
    "Saturn in Sagittarius": "Your challenges involve disciplined beliefs, higher education, and philosophical pursuits. You learn responsibility through structured learning and realistic idealism.",
    "Saturn in Capricorn": "Your discipline is naturally strong, focused on ambition, structure, and practical achievement. You excel at responsibility and building lasting legacies.",
    "Saturn in Aquarius": "Your lessons in discipline involve group dynamics, humanitarian ideals, and unconventional approaches. You learn responsibility through contributing to collective goals with integrity.",
    "Saturn in Pisces": "Your challenges involve disciplined intuition, spiritual practices, and managing emotional boundaries. You learn responsibility through compassionate service and grounding your idealism.",

    "Uranus in Aries": "This generation experiences breakthroughs and rebellion in areas of self-identity and pioneering action. They are driven to innovate and challenge existing norms directly.",
    "Uranus in Taurus": "This generation seeks innovation and disruption in values, financial systems, and material security. They challenge traditional stability and seek new ways of valuing resources.",
    "Uranus in Gemini": "This generation brings breakthroughs in communication, education, and intellectual freedom. They challenge conventional thinking and introduce new forms of information exchange.",
    "Uranus in Cancer": "This generation experiences sudden changes and unconventional approaches to home, family, and emotional security. They redefine traditional domestic structures and nurturing.",
    "Uranus in Leo": "This generation brings innovation and rebellion in self-expression, creativity, and leadership. They challenge traditional authority and seek unique ways to shine.",
    "Uranus in Virgo": "This generation seeks breakthroughs in work, health, and daily routines. They introduce unconventional methods for efficiency and holistic well-being.",
    "Uranus in Libra": "This generation brings innovation and disruption to relationships, justice, and social harmony. They challenge traditional partnerships and seek new forms of equality.",
    "Uranus in Scorpio": "This generation experiences profound transformations and unconventional approaches to power, shared resources, and intimacy. They revolutionize deep psychological and financial structures.",
    "Uranus in Sagittarius": "This generation seeks breakthroughs in philosophy, higher education, and global exploration. They challenge traditional beliefs and expand collective consciousness.",
    "Uranus in Capricorn": "This generation brings innovation and disruption to established structures, authority, and societal norms. They challenge traditional systems and seek new forms of governance.",
    "Uranus in Aquarius": "This generation is naturally innovative, rebellious, and focused on humanitarian ideals. They embody the future, driving social change and technological advancement.",
    "Uranus in Pisces": "This generation experiences breakthroughs in spirituality, compassion, and collective consciousness. They challenge traditional boundaries and explore new dimensions of intuition and empathy.",

    "Neptune in Aries": "This generation experiences a dissolution of boundaries in self-assertion and pioneering. They may struggle with defining their individual path or be inspired by collective action.",
    "Neptune in Taurus": "This generation experiences a blurring of boundaries in values, material possessions, and security. They may idealize wealth or struggle with tangible realities.",
    "Neptune in Gemini": "This generation experiences a dissolution of clarity in communication and information. They may be highly imaginative in thought or prone to confusion and misinformation.",
    "Neptune in Cancer": "This generation experiences a blurring of boundaries in home, family, and emotional security. They may idealize family life or struggle with emotional boundaries.",
    "Neptune in Leo": "This generation experiences a dissolution of boundaries in self-expression, creativity, and leadership. They may idealize fame or struggle with authentic self-presentation.",
    "Neptune in Virgo": "This generation experiences a blurring of boundaries in work, health, and daily routines. They may idealize perfection or struggle with practical details and order.",
    "Neptune in Libra": "This generation experiences a dissolution of boundaries in relationships and justice. They may idealize partnerships or struggle with codependency and fairness.",
    "Neptune in Scorpio": "This generation experiences a blurring of boundaries in shared resources, intimacy, and transformation. They may idealize intense bonds or struggle with power dynamics and hidden truths.",
    "Neptune in Sagittarius": "This generation experiences a dissolution of boundaries in beliefs, philosophy, and higher education. They may idealize spiritual truths or struggle with dogmatism.",
    "Neptune in Capricorn": "This generation experiences a blurring of boundaries in societal structures, ambition, and responsibility. They may idealize authority or struggle with corruption and disillusionment.",
    "Neptune in Aquarius": "This generation experiences a dissolution of boundaries in group dynamics, humanitarian ideals, and innovation. They may idealize collective unity or struggle with impractical idealism.",
    "Neptune in Pisces": "This generation is highly empathetic, spiritual, and attuned to collective consciousness. They embody compassion and idealism, often blurring the lines between reality and illusion.",

    "Pluto in Aries": "This generation experiences profound transformation and power struggles related to identity and initiation. They are driven to redefine selfhood and assert their will.",
    "Pluto in Taurus": "This generation undergoes deep transformation in values, financial systems, and material security. They are forced to confront and rebuild their relationship with resources.",
    "Pluto in Gemini": "This generation experiences profound transformation in communication, learning, and local environments. They are driven to uncover hidden information and reshape narratives.",
    "Pluto in Cancer": "This generation undergoes deep transformation in family dynamics, emotional security, and roots. They are compelled to confront ancestral patterns and redefine home.",
    "Pluto in Leo": "This generation experiences profound transformation in self-expression, creativity, and leadership. They are driven to reclaim personal power and reshape forms of authority.",
    "Pluto in Virgo": "This generation undergoes deep transformation in work, health, and daily routines. They are compelled to confront imperfections and restructure systems for efficiency.",
    "Pluto in Libra": "This generation experiences profound transformation in relationships, justice, and social harmony. They are driven to redefine partnerships and confront power imbalances.",
    "Pluto in Scorpio": "This generation is inherently transformative, intensely focused on power, intimacy, and regeneration. They are driven to uncover deep truths and facilitate profound change.",
    "Pluto in Sagittarius": "This generation undergoes deep transformation in beliefs, philosophy, and global perspectives. They are compelled to confront dogmas and expand their understanding of truth.",
    "Pluto in Capricorn": "This generation experiences profound transformation in societal structures, institutions, and ambition. They are driven to dismantle old systems and rebuild with integrity.",
    "Pluto in Aquarius": "This generation undergoes deep transformation in group dynamics, humanitarian ideals, and innovation. They are compelled to confront collective power structures and reshape the future.",
    "Pluto in Pisces": "This generation experiences profound transformation in spirituality, collective consciousness, and hidden realms. They are driven to confront illusions and explore the depths of the subconscious."
  },
  "planetsInHouses": {
    "Sun in 1st House": "Your core identity is strongly expressed through your personality and appearance. You project a strong sense of self and are often seen as a leader.",
    "Sun in 2nd House": "Your sense of self is tied to your values, resources, and material possessions. You find security and identity through what you own and earn.",
    "Sun in 3rd House": "Your identity is expressed through communication, learning, and your immediate environment. You are curious, adaptable, and enjoy sharing information.",
    "Sun in 4th House": "Your core being is deeply connected to your roots, family, and home. You find your identity and security in your private life and emotional foundations.",
    "Sun in 5th House": "Your identity shines through creativity, self-expression, and enjoyment. You find purpose in hobbies, romance, and anything that brings you joy.",
    "Sun in 6th House": "Your sense of self is found in service, daily routines, and health. You are dedicated to being productive and helping others, often through practical means.",
    "Sun in 7th House": "Your identity is strongly linked to partnerships and relationships. You find yourself through interaction with others, especially in one-on-one connections.",
    "Sun in 8th House": "Your core being is tied to transformation, shared resources, and deep psychological processes. You find your identity through intense experiences and understanding hidden truths.",
    "Sun in 9th House": "Your identity is expressed through higher learning, philosophy, and exploration. You seek truth and meaning through travel, education, and broad perspectives.",
    "Sun in 10th House": "Your sense of self is connected to your career, public image, and ambitions. You find identity and purpose through your achievements and recognition in the world.",
    "Sun in 11th House": "Your identity is expressed through group associations, friendships, and humanitarian ideals. You find purpose in contributing to collective goals and social causes.",
    "Sun in 12th House": "Your core being is connected to spirituality, introspection, and hidden realms. You find your identity through selfless service and understanding the subconscious.",

    "Moon in 1st House": "Your emotional responses are immediate and visible to others. You wear your heart on your sleeve, and your moods are often apparent.",
    "Moon in 2nd House": "You find emotional security in material possessions and financial stability. Your feelings are tied to your sense of self-worth and what you own.",
    "Moon in 3rd House": "You find emotional comfort in communication, learning, and familiar surroundings. Your moods are often influenced by your immediate environment and conversations.",
    "Moon in 4th House": "You are deeply emotional and find security in your home and family. Your feelings are rooted in your past and your private life.",
    "Moon in 5th House": "You find emotional expression through creativity, romance, and leisure activities. You need to feel playful and appreciated to feel emotionally secure.",
    "Moon in 6th House": "You find emotional security in routine, service, and practical matters. Your feelings are often linked to your work environment and daily habits.",
    "Moon in 7th House": "You seek emotional connection and security through partnerships. Your feelings are often influenced by your significant relationships.",
    "Moon in 8th House": "Your emotional world is intense, private, and transformative. You find security in deep intimacy and understanding hidden aspects of life.",
    "Moon in 9th House": "You find emotional comfort in exploring new ideas, travel, and philosophical pursuits. Your feelings are expansive and seek broader understanding.",
    "Moon in 10th House": "You seek emotional security through your public image and career achievements. Your feelings are often tied to your reputation and professional standing.",
    "Moon in 11th House": "You find emotional security in groups, friendships, and shared ideals. Your feelings are often expressed through collective endeavors and humanitarian causes.",
    "Moon in 12th House": "Your emotional nature is highly sensitive, intuitive, and connected to the subconscious. You find security in solitude, spiritual practices, and helping others quietly.",

    "Mercury in 1st House": "Your communication style is direct, assertive, and highly personal. You express your thoughts with conviction and often take the lead in conversations.",
    "Mercury in 2nd House": "Your mind is practical and focused on values, money, and resources. You communicate about tangible matters and think about how to build security.",
    "Mercury in 3rd House": "Your communication is natural, curious, and adaptable to your immediate environment. You enjoy learning, talking, and connecting with others in your local area.",
    "Mercury in 4th House": "Your thinking is influenced by your emotions, roots, and family history. You communicate about personal feelings and find comfort in familiar topics.",
    "Mercury in 5th House": "Your mind is creative, playful, and expressive. You enjoy communicating through artistic endeavors, romance, and recreational activities.",
    "Mercury in 6th House": "Your thinking is analytical, practical, and focused on details and efficiency. You communicate clearly about work, health, and daily routines.",
    "Mercury in 7th House": "Your communication is diplomatic and focused on partnerships and relationships. You seek balance in conversations and enjoy intellectual exchange with others.",
    "Mercury in 8th House": "Your mind is penetrating, investigative, and drawn to hidden truths. You communicate about deep, transformative subjects and enjoy uncovering secrets.",
    "Mercury in 9th House": "Your thinking is expansive, philosophical, and focused on higher learning and travel. You communicate about broad concepts and enjoy exploring new cultures.",
    "Mercury in 10th House": "Your communication is clear, authoritative, and focused on your career and public image. You are seen as knowledgeable and articulate in your profession.",
    "Mercury in 11th House": "Your mind is innovative, objective, and focused on group dynamics and humanitarian ideals. You communicate unique ideas and enjoy intellectual discussions within social circles.",
    "Mercury in 12th House": "Your thinking is intuitive, imaginative, and often subconscious. You communicate through creative outlets or in subtle ways, often picking up on unspoken cues.",

    "Venus in 1st House": "You project charm, grace, and a love for beauty in your appearance and personality. You are attractive to others and seek harmonious interactions.",
    "Venus in 2nd House": "You find pleasure in material comfort, luxury, and financial security. You value beautiful possessions and express affection through generosity.",
    "Venus in 3rd House": "You express affection through communication, charm, and social connections. You enjoy lighthearted conversations and harmonious interactions with siblings or neighbors.",
    "Venus in 4th House": "You find comfort and pleasure in your home and family life. You are nurturing and create a beautiful, harmonious domestic environment.",
    "Venus in 5th House": "You find joy and express love through creativity, romance, and playful activities. You are affectionate and enjoy being admired for your talents.",
    "Venus in 6th House": "You find pleasure in service, daily routines, and healthy habits. You express affection by being helpful and creating a harmonious work environment.",
    "Venus in 7th House": "You seek harmony and pleasure primarily through partnerships and relationships. You are diplomatic and thrive in balanced, committed connections.",
    "Venus in 8th House": "You find pleasure in deep intimacy, shared resources, and transformative experiences. Your affections are intense and you are drawn to profound emotional bonds.",
    "Venus in 9th House": "You find pleasure in higher learning, travel, and philosophical exploration. You are attracted to different cultures and share your affections through shared ideals.",
    "Venus in 10th House": "You find pleasure in your career, public image, and achievements. You are charming and diplomatic in your professional life, attracting success and recognition.",
    "Venus in 11th House": "You find pleasure in friendships, group activities, and humanitarian causes. You express affection through shared ideals and social connections.",
    "Venus in 12th House": "You find pleasure in solitude, spirituality, and compassionate service. Your affections are often expressed subtly and you are drawn to hidden beauty.",

    "Mars in 1st House": "Your drive is assertive, energetic, and direct. You are a self-starter and project a strong, sometimes confrontational, presence.",
    "Mars in 2nd House": "Your energy is directed towards acquiring resources and building financial security. You are driven to earn money and protect your possessions.",
    "Mars in 3rd House": "Your energy is expressed through communication, quick thinking, and local activities. You are assertive in your speech and enjoy mental challenges.",
    "Mars in 4th House": "Your drive is focused on your home, family, and emotional security. You are protective of your domestic space and may be assertive within the family.",
    "Mars in 5th House": "Your energy is directed towards creativity, romance, and recreational pursuits. You are passionate about your hobbies and enjoy competitive activities.",
    "Mars in 6th House": "Your drive is focused on work, daily routines, and health. You are energetic in your tasks and motivated to improve efficiency and well-being.",
    "Mars in 7th House": "Your energy is expressed through partnerships and relationships. You are assertive in one-on-one interactions and may encounter competition in relationships.",
    "Mars in 8th House": "Your drive is intense, strategic, and focused on shared resources and transformation. You are motivated by power dynamics and uncovering hidden truths.",
    "Mars in 9th House": "Your energy is directed towards higher learning, travel, and philosophical exploration. You are driven to expand your horizons and assert your beliefs.",
    "Mars in 10th House": "Your drive is ambitious, goal-oriented, and focused on career and public recognition. You are assertive in your profession and strive for leadership.",
    "Mars in 11th House": "Your energy is expressed through group activities, friendships, and humanitarian causes. You are driven to initiate change within social circles.",
    "Mars in 12th House": "Your drive is often subconscious, directed towards hidden activities or spiritual pursuits. You may struggle with direct assertion, preferring to work behind the scenes.",

    "Jupiter in 1st House": "You project an optimistic, expansive, and benevolent personality. You are naturally lucky and inspire confidence in others with your positive outlook.",
    "Jupiter in 2nd House": "Your financial growth and good fortune come through your values and resources. You have a generous attitude towards money and opportunities for abundance.",
    "Jupiter in 3rd House": "Your learning and communication are expansive, bringing good fortune through ideas and connections. You are optimistic in your local environment and enjoy sharing knowledge.",
    "Jupiter in 4th House": "Your home and family life bring you great comfort and good fortune. You have a generous spirit towards your roots and find security in your domestic sphere.",
    "Jupiter in 5th House": "You find great joy and luck in creative self-expression, romance, and playful activities. You are naturally optimistic about your talents and enjoy taking risks.",
    "Jupiter in 6th House": "Your work and daily routines bring opportunities for growth and good fortune. You are optimistic about your health and find success through helpful service.",
    "Jupiter in 7th House": "Your partnerships and relationships bring you great expansion and luck. You attract benevolent partners and find opportunities through collaboration.",
    "Jupiter in 8th House": "Your growth and good fortune come through shared resources, inheritance, and deep transformation. You have an optimistic approach to intense life changes.",
    "Jupiter in 9th House": "Your expansion is natural through higher education, travel, and philosophical exploration. You are inherently lucky when pursuing knowledge and broadening your horizons.",
    "Jupiter in 10th House": "Your career and public image bring significant growth and good fortune. You are optimistic about your ambitions and attract recognition and success.",
    "Jupiter in 11th House": "Your friendships, group associations, and humanitarian ideals bring great expansion and luck. You find opportunities through networking and collective endeavors.",
    "Jupiter in 12th House": "Your growth and good fortune come through spiritual pursuits, introspection, and selfless service. You find hidden blessings and protection through compassion.",

    "Saturn in 1st House": "You project a serious, disciplined, and responsible demeanor. You may appear reserved initially, but you are determined and build a solid personal foundation.",
    "Saturn in 2nd House": "Your lessons in discipline involve managing resources, building self-worth, and financial security. You learn responsibility through practical money management.",
    "Saturn in 3rd House": "Your challenges involve disciplined thinking, clear communication, and overcoming mental restlessness. You learn responsibility through focused study and effective expression.",
    "Saturn in 4th House": "Your lessons in discipline are centered on emotional security, family foundations, and nurturing. You learn responsibility through managing your feelings and building secure domestic life.",
    "Saturn in 5th House": "Your challenges involve disciplined self-expression, creative endeavors, and romance. You learn responsibility through structured hobbies and authentic self-mastery.",
    "Saturn in 6th House": "Your lessons in discipline involve meticulous work, health routines, and practical service. You learn responsibility through attention to detail and efficient systems.",
    "Saturn in 7th House": "Your challenges involve disciplined relationships, fairness, and achieving balance. You learn responsibility through committed partnerships and seeking true justice.",
    "Saturn in 8th House": "Your lessons in discipline are centered on transformation, shared resources, and emotional intensity. You learn responsibility through managing power and deep psychological processes.",
    "Saturn in 9th House": "Your challenges involve disciplined beliefs, higher education, and philosophical pursuits. You learn responsibility through structured learning and realistic idealism.",
    "Saturn in 10th House": "Your discipline is naturally strong, focused on ambition, structure, and practical achievement. You excel at responsibility and building lasting legacies.",
    "Saturn in 11th House": "Your lessons in discipline involve group dynamics, humanitarian ideals, and unconventional approaches. You learn responsibility through contributing to collective goals with integrity.",
    "Saturn in 12th House": "Your challenges involve disciplined intuition, spiritual practices, and managing emotional boundaries. You learn responsibility through compassionate service and grounding your idealism.",

    "Uranus in 1st House": "You project an unconventional, independent, and innovative personality. You are a pioneer of new ideas and may appear eccentric or rebellious.",
    "Uranus in 2nd House": "You experience sudden changes and unconventional approaches to values and finances. You seek freedom in your resources and may have erratic income.",
    "Uranus in 3rd House": "You have an innovative mind and communicate in unique, sometimes erratic, ways. You bring breakthroughs in learning and your immediate environment.",
    "Uranus in 4th House": "You experience sudden changes and unconventional approaches to home and family life. You seek freedom from traditional domestic structures and nurturing.",
    "Uranus in 5th House": "You have an innovative approach to creativity, romance, and self-expression. You seek unique forms of pleasure and may have unconventional hobbies.",
    "Uranus in 6th House": "You bring innovation and sudden changes to your work, daily routines, and health. You seek freedom in your job and may have unconventional health practices.",
    "Uranus in 7th House": "You experience sudden changes and unconventional approaches to partnerships and relationships. You seek freedom and individuality within your connections.",
    "Uranus in 8th House": "You experience sudden changes and unconventional approaches to shared resources, intimacy, and transformation. You are drawn to revolutionary insights into hidden matters.",
    "Uranus in 9th House": "You have an innovative approach to higher learning, philosophy, and travel. You seek freedom in your beliefs and are drawn to unconventional truths.",
    "Uranus in 10th House": "You bring innovation and sudden changes to your career and public image. You seek freedom in your profession and may have an unconventional public role.",
    "Uranus in 11th House": "You are naturally innovative, rebellious, and focused on humanitarian ideals within groups. You seek freedom through social change and unique friendships.",
    "Uranus in 12th House": "You experience sudden insights and unconventional approaches to spirituality and the subconscious. You seek freedom from hidden limitations and explore mystical realms.",

    "Neptune in 1st House": "You project a sensitive, intuitive, and sometimes elusive personality. You may appear dreamy or have a chameleon-like quality, blurring personal boundaries.",
    "Neptune in 2nd House": "You experience a dissolution of boundaries in values and financial security. You may idealize wealth or struggle with tangible realities, sometimes being impractical with money.",
    "Neptune in 3rd House": "Your communication is imaginative, intuitive, and sometimes unclear. You may be highly creative in thought or prone to confusion and misinformation in your immediate environment.",
    "Neptune in 4th House": "You experience a blurring of boundaries in home, family, and emotional security. You may idealize family life or struggle with emotional boundaries within your domestic sphere.",
    "Neptune in 5th House": "Your creativity is highly imaginative and inspired, sometimes blurring the lines of reality. You may idealize romance or struggle with self-deception in playful pursuits.",
    "Neptune in 6th House": "You experience a dissolution of boundaries in work, health, and daily routines. You may idealize perfection in service or struggle with practical details and chronic conditions.",
    "Neptune in 7th House": "You experience a blurring of boundaries in relationships and partnerships. You may idealize your partners or struggle with codependency and unclear expectations.",
    "Neptune in 8th House": "You experience a dissolution of boundaries in shared resources, intimacy, and transformation. You may idealize intense bonds or struggle with power dynamics and hidden truths.",
    "Neptune in 9th House": "You experience a blurring of boundaries in beliefs, philosophy, and higher education. You may idealize spiritual truths or struggle with dogmatism and impractical ideals.",
    "Neptune in 10th House": "You experience a dissolution of boundaries in your career and public image. You may idealize your professional role or struggle with disillusionment and unclear ambitions.",
    "Neptune in 11th House": "You experience a blurring of boundaries in group dynamics, humanitarian ideals, and friendships. You may idealize collective unity or struggle with impractical idealism and deceptive friends.",
    "Neptune in 12th House": "You are highly empathetic, spiritual, and attuned to collective consciousness in your subconscious. You find solace in solitude and selfless service, often blurring the lines between reality and illusion.",

    "Pluto in 1st House": "You project an intense, powerful, and transformative personality. You are driven to redefine yourself and assert your will, often facing profound personal crises.",
    "Pluto in 2nd House": "You experience profound transformation and power struggles related to your values and financial resources. You are compelled to confront and rebuild your relationship with money and possessions.",
    "Pluto in 3rd House": "You experience deep transformation in communication, learning, and your immediate environment. You are driven to uncover hidden information and reshape narratives in your local sphere.",
    "Pluto in 4th House": "You undergo profound transformation in family dynamics, emotional security, and your psychological roots. You are compelled to confront ancestral patterns and redefine your sense of home.",
    "Pluto in 5th House": "You experience intense transformation in creativity, romance, and self-expression. You are driven to reclaim personal power through your passions and may face intense romantic experiences.",
    "Pluto in 6th House": "You undergo deep transformation in work, health, and daily routines. You are compelled to confront imperfections and restructure systems for efficiency and well-being.",
    "Pluto in 7th House": "You experience profound transformation and power struggles in partnerships and relationships. You are driven to redefine your connections and confront imbalances of power.",
    "Pluto in 8th House": "You are inherently transformative, intensely focused on power, intimacy, and regeneration in shared resources. You are driven to uncover deep truths and facilitate profound change in joint ventures.",
    "Pluto in 9th House": "You undergo deep transformation in beliefs, philosophy, and global perspectives. You are compelled to confront dogmas and expand your understanding of truth through intense study or travel.",
    "Pluto in 10th House": "You experience profound transformation in your career, public image, and ambitions. You are driven to dismantle old systems and rebuild your professional life with integrity and power.",
    "Pluto in 11th House": "You undergo deep transformation in group dynamics, humanitarian ideals, and friendships. You are compelled to confront collective power structures and reshape the future through social change.",
    "Pluto in 12th House": "You experience profound transformation in spirituality, collective consciousness, and hidden realms. You are driven to confront illusions and explore the depths of the subconscious, often in solitude."
  },
  "majorAspects": {
    "Sun Conjunction Moon": "This aspect indicates a strong integration of your conscious will and emotional nature. Your inner feelings align with your outward expression, leading to a unified personality.",
    "Sun Opposition Moon": "This aspect suggests a fundamental tension between your conscious desires and emotional needs. You may experience internal conflict or project these dynamics onto relationships.",
    "Sun Square Moon": "This aspect creates dynamic tension between your ego and emotions, driving you to overcome internal challenges. You may experience emotional fluctuations that push you toward growth.",
    "Sun Trine Moon": "This aspect signifies a harmonious flow between your conscious will and emotional nature. Your inner feelings support your outward expression, leading to emotional ease and balance.",
    "Sun Sextile Moon": "This aspect offers opportunities for harmonious integration between your conscious will and emotional needs. You can easily find ways to align your inner self with your outer actions.",

    "Sun Conjunction Mercury": "Your conscious will and intellect are closely aligned, making communication direct and purposeful. You express your ideas with conviction and clarity.",
    "Sun Opposition Mercury": "This aspect can create a dynamic where your personal will clashes with your intellectual expression. You may find it challenging to align your thoughts with your desires, or experience intellectual debates.",
    "Sun Square Mercury": "This aspect creates internal tension between your ego and your communication style, driving you to refine how you express yourself. You may face mental challenges that push you to articulate your thoughts more effectively.",
    "Sun Trine Mercury": "This aspect signifies a natural flow between your conscious will and intellectual abilities. You communicate easily and clearly, with your thoughts supporting your personal goals.",
    "Sun Sextile Mercury": "This aspect offers opportunities for harmonious communication and intellectual growth. You can easily express your ideas and find supportive ways to learn and share information.",

    "Sun Conjunction Venus": "Your core identity is intertwined with your capacity for love, beauty, and harmony. You radiate charm and attract pleasant experiences and relationships.",
    "Sun Opposition Venus": "This aspect can create a dynamic tension between your personal desires and your relationship needs. You may find it challenging to balance self-focus with partnership, or attract opposing relationship dynamics.",
    "Sun Square Venus": "This aspect creates internal tension between your ego and your relationships or values, driving you to find balance. You may face challenges in love or finances that push you toward growth.",
    "Sun Trine Venus": "This aspect signifies a natural harmony between your conscious will and your capacity for love and beauty. You easily attract pleasant experiences and enjoy harmonious relationships.",
    "Sun Sextile Venus": "This aspect offers opportunities for harmonious relationships and creative expression. You can easily attract love and beauty into your life, finding supportive connections.",

    "Sun Conjunction Mars": "Your conscious will is directly aligned with your drive and action. You are assertive, energetic, and pursue your goals with strong determination.",
    "Sun Opposition Mars": "This aspect can create a dynamic where your personal will clashes with your assertive drive. You may experience external conflicts or internal struggles with anger and action.",
    "Sun Square Mars": "This aspect creates internal tension between your ego and your drive, pushing you to overcome challenges in asserting yourself. You may face conflicts that demand courage and direct action.",
    "Sun Trine Mars": "This aspect signifies a natural flow between your conscious will and your drive for action. You are energetic and assertive, easily pursuing your goals with confidence.",
    "Sun Sextile Mars": "This aspect offers opportunities for dynamic action and assertive self-expression. You can easily tap into your drive to pursue goals and overcome challenges.",

    "Sun Conjunction Jupiter": "Your conscious will is aligned with expansion, optimism, and good fortune. You have a generous spirit and attract opportunities for growth and abundance.",
    "Sun Opposition Jupiter": "This aspect can create a dynamic where your personal will clashes with your desire for expansion, leading to overindulgence or inflated expectations. You may struggle to find balance between self-focus and broad horizons.",
    "Sun Square Jupiter": "This aspect creates internal tension between your ego and your desire for growth, pushing you to overcome challenges related to excess or unrealistic expectations. You may face opportunities that require disciplined expansion.",
    "Sun Trine Jupiter": "This aspect signifies a natural flow of optimism, generosity, and good fortune into your life. Your conscious will is supported by expansive opportunities and a positive outlook.",
    "Sun Sextile Jupiter": "This aspect offers opportunities for growth, optimism, and good fortune. You can easily attract positive experiences and find supportive paths for expansion.",

    "Sun Conjunction Saturn": "Your conscious will is aligned with discipline, responsibility, and structure. You approach life with seriousness and are driven to build lasting achievements.",
    "Sun Opposition Saturn": "This aspect can create a dynamic where your personal will clashes with limitations or responsibilities, leading to feelings of restriction or hard work. You may struggle to balance self-expression with external demands.",
    "Sun Square Saturn": "This aspect creates internal tension between your ego and challenges related to responsibility or limitations, pushing you to develop discipline. You may face obstacles that require perseverance and hard work.",
    "Sun Trine Saturn": "This aspect signifies a natural ability to apply discipline and structure to your goals. Your conscious will is supported by a strong work ethic and a realistic approach to life.",
    "Sun Sextile Saturn": "This aspect offers opportunities for disciplined effort and practical achievement. You can easily apply structure to your goals and find supportive ways to build lasting success.",

    "Sun Conjunction Uranus": "Your identity is infused with a desire for freedom and innovation. You express yourself in unique and unconventional ways, often challenging the status quo.",
    "Sun Opposition Uranus": "You may experience a tension between your core identity and a desire for sudden change or independence. Relationships or external events might challenge your sense of self, pushing for unexpected shifts.",
    "Sun Square Uranus": "Your drive for individuality may create friction with established norms or your own sense of stability. This tension fuels breakthroughs but can also lead to abrupt changes or rebellious tendencies.",
    "Sun Trine Uranus": "Your unique self-expression flows easily, allowing you to innovate and inspire without much resistance. You naturally embrace change and can pioneer new ideas harmoniously.",
    "Sun Sextile Uranus": "You have opportunities to express your individuality and embrace innovative ideas smoothly. This aspect supports making unique contributions and adapting to change constructively.",

    "Sun Conjunction Neptune": "Your core identity is intertwined with idealism, compassion, and imagination. You may have an elusive or artistic nature, with a strong connection to spiritual or empathetic pursuits.",
    "Sun Opposition Neptune": "You might struggle with defining your sense of self clearly, or face illusions in how you see yourself versus reality. Relationships may reflect this ambiguity, requiring you to differentiate your own needs from others'.",
    "Sun Square Neptune": "Your sense of self may be challenged by confusion, escapism, or a lack of clear boundaries. This tension can lead to creative breakthroughs or a need to ground your ideals in reality.",
    "Sun Trine Neptune": "Your compassionate and imaginative qualities are harmoniously integrated with your core identity. You easily express empathy and can inspire others through your artistic or spiritual insights.",
    "Sun Sextile Neptune": "You have opportunities to blend your idealism and creativity with your daily life. This aspect supports compassionate actions and finding inspiration in subtle ways.",

    "Sun Conjunction Pluto": "Your core identity is deeply transformative and powerful. You possess intense focus and a drive to get to the heart of matters, often experiencing profound personal evolution.",
    "Sun Opposition Pluto": "You may encounter power struggles or intense confrontations that challenge your sense of self. This can lead to deep transformations as you learn to integrate your personal power with external forces.",
    "Sun Square Pluto": "Your will may clash with powerful forces or your own deep-seated psychological patterns. This intense tension drives profound change and requires confronting issues of control and transformation.",
    "Sun Trine Pluto": "You naturally embody personal power and transformative abilities. You can easily regenerate and evolve, using your intensity to make a profound impact.",
    "Sun Sextile Pluto": "You have opportunities to harness your personal power for positive transformation. This aspect supports deep understanding and the ability to effect meaningful change constructively.",

    "Moon Conjunction Mercury": "Your emotions and intellect are closely intertwined, leading to intuitive and empathetic communication. You express your feelings articulately and think with emotional depth.",
    "Moon Opposition Mercury": "This aspect can create a dynamic where your emotions clash with your logical thinking. You may find it challenging to express your feelings rationally or experience internal debates.",
    "Moon Square Mercury": "This aspect creates internal tension between your emotions and your communication, pushing you to refine how you express your feelings. You may face mental challenges that demand emotional clarity.",
    "Moon Trine Mercury": "This aspect signifies a natural flow between your emotions and your intellect. You communicate with ease and empathy, and your thoughts are often guided by your intuition.",
    "Moon Sextile Mercury": "This aspect offers opportunities for intuitive communication and emotional expression. You can easily articulate your feelings and find supportive ways to connect with others mentally.",

    "Moon Conjunction Venus": "Your emotions and capacity for love are deeply integrated, leading to a harmonious and affectionate nature. You express your feelings with grace and attract pleasant experiences.",
    "Moon Opposition Venus": "This aspect can create a dynamic where your emotional needs clash with your relationship desires. You may struggle to find balance between personal comfort and partnership harmony.",
    "Moon Square Venus": "This aspect creates internal tension between your emotions and your relationships or values, pushing you to find emotional balance. You may face challenges in love or finances that demand emotional maturity.",
    "Moon Trine Venus": "This aspect signifies a natural harmony between your emotions and your capacity for love and beauty. You easily attract pleasant experiences and enjoy harmonious emotional connections.",
    "Moon Sextile Venus": "This aspect offers opportunities for emotional harmony and affectionate relationships. You can easily express love and find supportive connections that bring comfort.",

    "Moon Conjunction Mars": "Your emotions are directly aligned with your drive and assertiveness. You react impulsively and passionately, often acting on your feelings.",
    "Moon Opposition Mars": "This aspect can create a dynamic where your emotional needs clash with your assertive drive, leading to internal conflict or external disputes. You may struggle to control your emotional reactions.",
    "Moon Square Mars": "This aspect creates internal tension between your emotions and your drive, pushing you to manage impulsive reactions. You may face emotional conflicts that demand assertive but controlled action.",
    "Moon Trine Mars": "This aspect signifies a natural flow between your emotions and your drive for action. You are emotionally courageous and assert your needs with ease and confidence.",
    "Moon Sextile Mars": "This aspect offers opportunities for emotional assertiveness and dynamic action. You can easily tap into your feelings to motivate yourself and overcome challenges.",

    "Moon Conjunction Jupiter": "Your emotions are aligned with optimism, generosity, and good fortune. You have a benevolent emotional nature and attract opportunities for emotional growth.",
    "Moon Opposition Jupiter": "This aspect can create a dynamic where your emotional needs clash with your desire for expansion, leading to emotional overindulgence or exaggerated reactions. You may struggle to find emotional balance.",
    "Moon Square Jupiter": "This aspect creates internal tension between your emotions and your desire for growth, pushing you to overcome challenges related to emotional excess or unrealistic expectations. You may face emotional opportunities that require disciplined expansion.",
    "Moon Trine Jupiter": "This aspect signifies a natural flow of emotional optimism, generosity, and good fortune. Your feelings are expansive and you find comfort in growth and abundance.",
    "Moon Sextile Jupiter": "This aspect offers opportunities for emotional growth and positive experiences. You can easily attract comfort and find supportive paths for emotional expansion.",

    "Moon Conjunction Saturn": "Your emotions are aligned with discipline, responsibility, and seriousness. You approach your feelings with caution and seek emotional security through structure.",
    "Moon Opposition Saturn": "This aspect can create a dynamic where your emotional needs clash with limitations or responsibilities, leading to feelings of restriction or emotional coldness. You may struggle to express your feelings freely.",
    "Moon Square Saturn": "This aspect creates internal tension between your emotions and challenges related to responsibility or limitations, pushing you to develop emotional maturity. You may face emotional obstacles that require perseverance and self-discipline.",
    "Moon Trine Saturn": "This aspect signifies a natural ability to manage your emotions with discipline and responsibility. Your feelings are stable and you find emotional security through structure and commitment.",
    "Moon Sextile Saturn": "This aspect offers opportunities for emotional stability and disciplined self-care. You can easily apply structure to your emotional life and find supportive ways to build emotional resilience.",

    "Moon Conjunction Uranus": "Your emotional nature is excitable and seeks freedom. You react to situations in unique, often sudden ways and value emotional independence.",
    "Moon Opposition Uranus": "Your need for emotional security may clash with a desire for independence or unexpected disruptions. Relationships can feel unstable or you might swing between needing closeness and wanting freedom.",
    "Moon Square Uranus": "Emotional restlessness and a craving for excitement can create tension with your need for stability. This can lead to sudden emotional outbursts or erratic behavior if not managed constructively.",
    "Moon Trine Uranus": "You express your emotions in unique and inventive ways, easily adapting to change. Your intuition is strong, and you naturally embrace emotional freedom and originality.",
    "Moon Sextile Uranus": "You have opportunities to embrace emotional innovation and independence smoothly. This aspect helps in finding constructive outlets for your unique feelings and adapting to change with ease.",

    "Moon Conjunction Neptune": "You are highly sensitive and empathetic, with a rich inner emotional life. Your feelings are deeply connected to imagination, intuition, and compassion.",
    "Moon Opposition Neptune": "You may struggle with emotional boundaries, easily absorbing others' feelings or facing confusion about your own. Relationships might involve idealization or disillusionment, requiring clarity.",
    "Moon Square Neptune": "Your emotional sensitivity can lead to confusion, escapism, or a tendency to be easily influenced. This tension calls for grounding your feelings and developing emotional discernment.",
    "Moon Trine Neptune": "Your compassionate and intuitive emotional nature flows easily, allowing for deep empathy and artistic expression. You naturally connect with others on a subtle, emotional level.",
    "Moon Sextile Neptune": "You have opportunities to express your compassion and intuition constructively. This aspect supports artistic endeavors and finding solace in gentle, empathetic connections.",

    "Moon Conjunction Pluto": "Your emotions are intense, deep, and transformative. You experience feelings powerfully and are drawn to profound emotional connections and psychological exploration.",
    "Moon Opposition Pluto": "Emotional power struggles or intense, cathartic experiences can arise in relationships or from within. You may face challenges in letting go of control or dealing with deeply buried feelings.",
    "Moon Square Pluto": "Your deep emotions can create internal tension or conflict, especially around issues of control, trust, or letting go. This drives profound emotional transformation but can be challenging.",
    "Moon Trine Pluto": "You possess profound emotional resilience and the ability to navigate deep psychological waters with ease. You naturally understand emotional power and can facilitate healing.",
    "Moon Sextile Pluto": "You have opportunities to use your emotional depth and intensity for positive transformation. This aspect supports healing, understanding hidden dynamics, and forming profound bonds.",

    "Mercury Conjunction Venus": "Your communication and capacity for love are harmoniously integrated, leading to charming and diplomatic expression. You convey affection easily and appreciate beauty in language.",
    "Mercury Opposition Venus": "This aspect can create a dynamic where your intellectual expression clashes with your relationship needs or values. You may find it challenging to communicate harmoniously in partnerships.",
    "Mercury Square Venus": "This aspect creates internal tension between your communication and your relationships or values, pushing you to refine how you express affection. You may face challenges in conveying your desires effectively.",
    "Mercury Trine Venus": "This aspect signifies a natural flow between your communication and your capacity for love and beauty. You express yourself gracefully and enjoy harmonious intellectual exchanges.",
    "Mercury Sextile Venus": "This aspect offers opportunities for charming communication and harmonious relationships. You can easily express affection and find supportive ways to connect with others intellectually.",

    "Mercury Conjunction Mars": "Your intellect and drive are closely aligned, leading to direct, assertive, and energetic communication. You speak your mind quickly and are persuasive in your arguments.",
    "Mercury Opposition Mars": "This aspect can create a dynamic where your intellectual expression clashes with your assertive drive, leading to sharp debates or verbal conflicts. You may find it challenging to communicate without confrontation.",
    "Mercury Square Mars": "This aspect creates internal tension between your communication and your drive, pushing you to refine your assertiveness. You may face mental challenges that demand direct but controlled expression.",
    "Mercury Trine Mars": "This aspect signifies a natural flow between your intellect and your drive for action. You communicate with energy and assertiveness, easily expressing your ideas with conviction.",
    "Mercury Sextile Mars": "This aspect offers opportunities for dynamic communication and assertive problem-solving. You can easily articulate your drive and find supportive ways to take action.",

    "Mercury Conjunction Jupiter": "Your intellect is aligned with expansion, optimism, and broad understanding. You communicate with enthusiasm and attract opportunities for learning and sharing knowledge.",
    "Mercury Opposition Jupiter": "This aspect can create a dynamic where your intellectual expression clashes with your desire for expansive knowledge, leading to exaggerated claims or impractical ideas. You may struggle to focus your thoughts.",
    "Mercury Square Jupiter": "This aspect creates internal tension between your communication and your desire for growth, pushing you to refine your intellectual approach. You may face mental challenges that demand realistic and focused thinking.",
    "Mercury Trine Jupiter": "This aspect signifies a natural flow of optimism and expansive thinking into your communication. You express yourself with enthusiasm and easily grasp broad concepts.",
    "Mercury Sextile Jupiter": "This aspect offers opportunities for intellectual growth and optimistic communication. You can easily expand your knowledge and find supportive ways to share your insights.",

    "Mercury Conjunction Saturn": "Your intellect is aligned with discipline, responsibility, and structured thinking. You communicate with precision and approach problems with a serious, practical mindset.",
    "Mercury Opposition Saturn": "This aspect can create a dynamic where your intellectual expression clashes with limitations or serious responsibilities. You may find it challenging to communicate freely or experience mental blocks.",
    "Mercury Square Saturn": "This aspect creates internal tension between your communication and challenges related to responsibility or limitations, pushing you to develop mental discipline. You may face intellectual obstacles that require perseverance and precision.",
    "Mercury Trine Saturn": "This aspect signifies a natural ability to apply discipline and structure to your thinking. You communicate with clarity and authority, and your ideas are well-grounded and practical.",
    "Mercury Sextile Saturn": "This aspect offers opportunities for disciplined thinking and practical communication. You can easily apply structure to your ideas and find supportive ways to express them clearly.",

    "Mercury Conjunction Uranus": "Your mind is inventive, original, and quick. You communicate in unconventional ways and often have sudden insights or breakthroughs in thinking.",
    "Mercury Opposition Uranus": "Your conventional thinking may clash with a desire for radical ideas or face disruptive communication from others. You might find it hard to reconcile tradition with innovation in your thoughts.",
    "Mercury Square Uranus": "Your communication style can be erratic or rebellious, creating tension with established norms or your own need for clarity. This drives you to find constructive outlets for your unique ideas.",
    "Mercury Trine Uranus": "Your innovative ideas and unique communication style flow easily. You naturally grasp futuristic concepts and can express them in an inspiring and harmonious way.",
    "Mercury Sextile Uranus": "You have opportunities to share your original ideas and insights constructively. This aspect supports innovative thinking and finding unique solutions to problems.",

    "Mercury Conjunction Neptune": "Your thinking is highly imaginative, intuitive, and empathetic. You communicate with sensitivity and creativity, often grasping unspoken nuances and expressing artistic ideas.",
    "Mercury Opposition Neptune": "Your logical thinking may be clouded by illusion or idealism, or you may struggle to communicate clearly due to confusion. You need to discern truth from fantasy in your thoughts and words.",
    "Mercury Square Neptune": "Your communication can be unclear, deceptive, or prone to misunderstanding, creating tension between your thoughts and reality. This drives a need for clarity and grounding your imagination.",
    "Mercury Trine Neptune": "Your intuitive and imaginative thinking flows harmoniously with your communication style. You easily express creative ideas and connect with others on a subtle, empathetic level.",
    "Mercury Sextile Neptune": "You have opportunities to express your imaginative and intuitive thoughts constructively. This aspect supports creative writing, compassionate communication, and artistic pursuits.",

    "Mercury Conjunction Pluto": "Your mind is penetrating, investigative, and drawn to deep truths. You communicate with intensity and possess a powerful ability to uncover hidden information and influence others.",
    "Mercury Opposition Pluto": "Your ideas may face intense opposition or you might engage in power struggles over information. You need to learn to communicate your potent insights without coercion or encountering manipulation.",
    "Mercury Square Pluto": "Your communication can be obsessive or confrontational, creating tension as you delve into hidden or taboo subjects. This drives a need for transforming your thought patterns and speaking with integrity.",
    "Mercury Trine Pluto": "You possess a natural ability to communicate with profound depth and insight. Your words carry weight, and you can easily facilitate transformation and uncover hidden truths.",
    "Mercury Sextile Pluto": "You have opportunities to use your insightful communication for positive transformation. This aspect supports deep research, effective persuasion, and understanding complex issues.",

    "Venus Conjunction Mars": "Your capacity for love and your drive are closely aligned, leading to passionate and assertive expression of affection. You are direct in pursuing your desires in relationships.",
    "Venus Opposition Mars": "This aspect can create a dynamic where your relationship needs clash with your assertive drive, leading to tension or conflict in love. You may struggle to find balance between harmony and passion.",
    "Venus Square Mars": "This aspect creates internal tension between your relationships and your drive, pushing you to find a balance between harmony and assertiveness. You may face conflicts in love that demand direct but diplomatic action.",
    "Venus Trine Mars": "This aspect signifies a natural flow between your capacity for love and your drive for action. You express affection with passion and pursue your desires in relationships with ease.",
    "Venus Sextile Mars": "This aspect offers opportunities for passionate relationships and assertive expression of affection. You can easily combine charm with drive to achieve your desires.",

    "Venus Conjunction Jupiter": "Your capacity for love is aligned with expansion, optimism, and good fortune. You are generous in affection and attract abundant blessings in relationships and finances.",
    "Venus Opposition Jupiter": "This aspect can create a dynamic where your relationship needs clash with your desire for expansion, leading to overindulgence or inflated expectations in love or finances. You may struggle to find balance between personal desires and broad generosity.",
    "Venus Square Jupiter": "This aspect creates internal tension between your relationships/values and your desire for growth, pushing you to overcome challenges related to excess or unrealistic expectations. You may face opportunities in love or finances that require disciplined expansion.",
    "Venus Trine Jupiter": "This aspect signifies a natural flow of optimism, generosity, and good fortune into your relationships and finances. You easily attract pleasant experiences and enjoy harmonious connections.",
    "Venus Sextile Jupiter": "This aspect offers opportunities for harmonious relationships and financial growth. You can easily attract love and abundance, finding supportive paths for expansion.",

    "Venus Conjunction Saturn": "Your capacity for love is aligned with discipline, responsibility, and commitment. You approach relationships with seriousness and seek lasting, stable bonds.",
    "Venus Opposition Saturn": "This aspect can create a dynamic where your relationship needs clash with limitations or responsibilities, leading to feelings of restriction or difficulty in expressing affection. You may struggle to find joy in relationships.",
    "Venus Square Saturn": "This aspect creates internal tension between your relationships/values and challenges related to responsibility or limitations, pushing you to develop emotional maturity. You may face obstacles in love or finances that require perseverance and commitment.",
    "Venus Trine Saturn": "This aspect signifies a natural ability to apply discipline and structure to your relationships. You approach love with seriousness and build lasting, stable bonds with ease.",
    "Venus Sextile Saturn": "This aspect offers opportunities for disciplined relationships and practical approaches to love. You can easily apply structure to your affections and find supportive ways to build lasting connections.",

    "Venus Conjunction Uranus": "Your approach to love and relationships is unconventional, freedom-oriented, and exciting. You attract unusual connections and value independence in partnerships.",
    "Venus Opposition Uranus": "Your desire for stable relationships may clash with a need for freedom or unexpected disruptions in love. Partnerships can be unpredictable, requiring a balance between closeness and autonomy.",
    "Venus Square Uranus": "Your love life can be unstable or subject to sudden changes, creating tension between your need for affection and your desire for excitement. This drives you to find new ways of relating.",
    "Venus Trine Uranus": "You express affection in unique and exciting ways, easily attracting unconventional relationships. Your love life is often filled with stimulating experiences and mutual freedom.",
    "Venus Sextile Uranus": "You have opportunities to bring innovation and excitement into your relationships constructively. This aspect supports forming unique bonds and enjoying freedom within partnerships.",

    "Venus Conjunction Neptune": "You express love with idealism, compassion, and a touch of romance. You are highly empathetic in relationships and drawn to artistic or spiritual connections.",
    "Venus Opposition Neptune": "Your romantic ideals may clash with reality, leading to disillusionment or confusion in relationships. You need to see partners clearly and avoid sacrificing your own needs excessively.",
    "Venus Square Neptune": "Your love life or finances can be subject to deception, confusion, or unrealistic expectations. This tension calls for grounding your ideals and practicing discernment in relationships.",
    "Venus Trine Neptune": "Your compassionate and romantic nature flows harmoniously in relationships. You easily connect on an emotional and spiritual level, enjoying idyllic and artistic partnerships.",
    "Venus Sextile Neptune": "You have opportunities to express your romantic and compassionate ideals constructively. This aspect supports artistic collaborations and forming gentle, empathetic bonds.",

    "Venus Conjunction Pluto": "Your affections are intense, passionate, and transformative. You seek deep, meaningful connections and experience love with profound depth and loyalty.",
    "Venus Opposition Pluto": "Your relationships may involve power struggles or intense emotional dynamics. You need to learn to balance your desire for deep connection with issues of control and possessiveness.",
    "Venus Square Pluto": "Your love life can be marked by intense attractions, jealousy, or control issues, creating tension that drives profound transformation. This forces you to confront deep-seated emotional patterns.",
    "Venus Trine Pluto": "You possess a natural ability to form deep, transformative, and empowering relationships. Your affections have a healing quality, and you connect with others on a profound level.",
    "Venus Sextile Pluto": "You have opportunities to experience deep, transformative love and harness your emotional power constructively. This aspect supports healing in relationships and forming profound bonds.",

    "Mars Conjunction Jupiter": "Your drive is aligned with expansion, optimism, and good fortune. You are energetic in pursuing opportunities and act with confidence and enthusiasm.",
    "Mars Opposition Jupiter": "This aspect can create a dynamic where your assertive drive clashes with your desire for expansion, leading to impulsive actions or overestimation of abilities. You may struggle to temper your enthusiasm with realism.",
    "Mars Square Jupiter": "This aspect creates internal tension between your drive and your desire for growth, pushing you to overcome challenges related to excess or unrealistic expectations. You may face opportunities for action that require disciplined expansion.",
    "Mars Trine Jupiter": "This aspect signifies a natural flow of energy and optimism into your actions. You are enthusiastic and easily pursue opportunities for growth and adventure.",
    "Mars Sextile Jupiter": "This aspect offers opportunities for dynamic action and expansive growth. You can easily tap into your drive to pursue new horizons and find supportive paths for success.",

    "Mars Conjunction Saturn": "Your drive is aligned with discipline, responsibility, and structured action. You approach your goals with seriousness and persevere through challenges with determination.",
    "Mars Opposition Saturn": "This aspect can create a dynamic where your assertive drive clashes with limitations or responsibilities, leading to frustration or blocked action. You may struggle to initiate without encountering obstacles.",
    "Mars Square Saturn": "This aspect creates internal tension between your drive and challenges related to responsibility or limitations, pushing you to develop perseverance. You may face obstacles that require disciplined effort and strategic action.",
    "Mars Trine Saturn": "This aspect signifies a natural ability to apply discipline and structure to your actions. You are efficient and easily achieve your goals through consistent effort.",
    "Mars Sextile Saturn": "This aspect offers opportunities for disciplined action and practical achievement. You can easily apply structure to your drive and find supportive ways to build lasting success.",

    "Mars Conjunction Uranus": "Your actions are innovative, independent, and often sudden. You are driven by a desire for freedom and express your energy in unconventional or rebellious ways.",
    "Mars Opposition Uranus": "Your assertive drive may clash with unexpected disruptions or a rebellious streak, leading to impulsive actions or conflicts over freedom. You need to channel your energy constructively when facing abrupt changes.",
    "Mars Square Uranus": "Your energy can be explosive or erratic, creating tension between your desire for action and a need for stability. This drives you to find constructive outlets for your rebellious or innovative impulses.",
    "Mars Trine Uranus": "You express your drive in unique and inventive ways, easily pioneering new actions. Your energy is often directed towards innovation and embracing freedom harmoniously.",
    "Mars Sextile Uranus": "You have opportunities to channel your innovative energy and drive for freedom constructively. This aspect supports taking unique actions and adapting to sudden changes effectively.",

    "Mars Conjunction Neptune": "Your drive is often subtle, imaginative, and compassionate. You may act on intuition or be motivated by idealistic or artistic pursuits, sometimes lacking directness.",
    "Mars Opposition Neptune": "Your assertive actions may be undermined by confusion, escapism, or unclear motives. You need to ground your energy and ensure your actions align with reality to avoid disillusionment.",
    "Mars Square Neptune": "Your energy can be misdirected or weakened by uncertainty or idealism, creating tension between your desires and your ability to act effectively. This calls for clarity of purpose and practical application of your drive.",
    "Mars Trine Neptune": "Your actions are inspired by compassion and intuition, flowing harmoniously towards idealistic or artistic goals. You naturally channel your energy into imaginative and empathetic pursuits.",
    "Mars Sextile Neptune": "You have opportunities to use your energy in compassionate and imaginative ways. This aspect supports acting on your intuition and pursuing artistic or spiritual goals constructively.",

    "Mars Conjunction Pluto": "Your drive is incredibly intense, focused, and transformative. You possess immense willpower and act with a powerful determination to achieve profound results or overcome obstacles.",
    "Mars Opposition Pluto": "Your assertive actions may lead to intense power struggles or confrontations. You need to learn to wield your considerable energy without resorting to control or facing overwhelming opposition.",
    "Mars Square Pluto": "Your powerful drive can create intense conflicts or internal struggles related to control, anger, or obsession. This forces profound transformation in how you assert your will and manage your power.",
    "Mars Trine Pluto": "You possess a natural ability to act with immense power and transformative effect. Your focused energy allows you to overcome any obstacle and achieve profound, lasting change.",
    "Mars Sextile Pluto": "You have opportunities to use your intense drive and willpower for constructive transformation. This aspect supports determined action, deep healing, and achieving significant goals.",

    "Jupiter Conjunction Saturn": "Your expansion and discipline are integrated, leading to practical growth and responsible ambition. You balance optimism with realism, building lasting success.",
    "Jupiter Opposition Saturn": "This aspect can create a dynamic where your desire for expansion clashes with limitations or responsibilities, leading to cycles of boom and bust or internal tension. You may struggle to balance optimism with realism.",
    "Jupiter Square Saturn": "This aspect creates internal tension between your desire for growth and challenges related to responsibility or limitations, pushing you to find a balance. You may face opportunities that require disciplined expansion and realistic planning.",
    "Jupiter Trine Saturn": "This aspect signifies a natural ability to integrate growth with structure and responsibility. You approach life with a balanced perspective, easily achieving practical success.",
    "Jupiter Sextile Saturn": "This aspect offers opportunities for practical growth and disciplined expansion. You can easily combine optimism with realism to achieve your goals.",

    "Jupiter Conjunction Uranus": "Your desire for growth is combined with innovation and a quest for freedom. You expand through unconventional means and embrace exciting new possibilities with optimism.",
    "Jupiter Opposition Uranus": "Your expansive tendencies may clash with sudden disruptions or a rebellious urge for freedom. You need to balance your optimism with the unexpected, avoiding recklessness in your pursuit of new horizons.",
    "Jupiter Square Uranus": "Your enthusiasm for growth can create tension with a desire for radical change or instability. This drives you to find constructive ways to innovate without sacrificing all structure.",
    "Jupiter Trine Uranus": "You naturally combine optimism with innovation, easily expanding your horizons in unique and exciting ways. You harmoniously embrace change and pioneer new approaches to growth.",
    "Jupiter Sextile Uranus": "You have opportunities to expand through innovative ideas and embrace sudden opportunities constructively. This aspect supports unique ventures and adapting to change with optimism.",

    "Jupiter Conjunction Neptune": "Your expansive qualities are blended with idealism, compassion, and imagination. You find growth through spiritual pursuits, artistic endeavors, and acts of generosity.",
    "Jupiter Opposition Neptune": "Your optimism and desire for expansion may be clouded by illusion, unrealistic ideals, or escapism. You need to ground your beliefs and ensure your generosity has clear boundaries to avoid disappointment.",
    "Jupiter Square Neptune": "Your expansive dreams can create tension with reality, leading to impracticality or disillusionment. This calls for bringing your idealistic visions into clearer focus and applying them realistically.",
    "Jupiter Trine Neptune": "You naturally express generosity, compassion, and spiritual wisdom, easily expanding through artistic and humanitarian channels. Your faith and imagination work in harmony to bring positive growth.",
    "Jupiter Sextile Neptune": "You have opportunities to expand through compassionate action and creative inspiration. This aspect supports humanitarian efforts and finding growth through intuitive and artistic means.",

    "Jupiter Conjunction Pluto": "Your drive for growth is combined with intense focus and transformative power. You have the ability to achieve significant, far-reaching success and wield considerable influence.",
    "Jupiter Opposition Pluto": "Your expansive ambitions may lead to power struggles or confrontations with overwhelming forces. You need to manage your desire for influence carefully, avoiding corruption or intense opposition.",
    "Jupiter Square Pluto": "Your quest for growth and success can create tension with issues of control, ethics, or profound transformation. This forces you to confront how you use power and pursue your ambitions with integrity.",
    "Jupiter Trine Pluto": "You possess a natural ability to achieve profound success and wield influence wisely. Your expansive vision is coupled with transformative power, leading to significant and positive impact.",
    "Jupiter Sextile Pluto": "You have opportunities to use your influence and resources for significant, positive transformation. This aspect supports ambitious undertakings that lead to profound and beneficial changes.",

    "Saturn Conjunction Uranus": "Your sense of discipline and structure is combined with a drive for innovation and freedom. You can build new, unconventional systems or feel tension between tradition and rebellion.",
    "Saturn Opposition Uranus": "Your desire for structure and security may clash with sudden disruptions or a rebellious urge for independence. You need to find a balance between maintaining order and embracing necessary change.",
    "Saturn Square Uranus": "Your adherence to tradition and rules can create tension with a desire for radical change or freedom. This dynamic forces you to re-evaluate old structures and adapt to new, unconventional approaches.",
    "Saturn Trine Uranus": "You can harmoniously blend discipline with innovation, creating new structures that are both stable and forward-thinking. You naturally find practical ways to implement progressive ideas.",
    "Saturn Sextile Uranus": "You have opportunities to combine traditional methods with innovative approaches constructively. This aspect supports reforming old systems and building for the future in a stable manner.",

    "Saturn Conjunction Neptune": "Your sense of discipline and reality is blended with idealism, compassion, and imagination. You work to give concrete form to your dreams or may feel a pull between practicality and escapism.",
    "Saturn Opposition Neptune": "Your practical approach to life may clash with vague ideals, confusion, or a tendency towards escapism. You need to ground your dreams in reality and overcome feelings of disillusionment with discipline.",
    "Saturn Square Neptune": "Your responsibilities and sense of order can create tension with idealism, confusion, or a lack of boundaries. This forces you to confront illusions and apply practical discipline to your compassionate goals.",
    "Saturn Trine Neptune": "You can harmoniously blend discipline with idealism, giving practical form to your imaginative or spiritual goals. Your compassion is grounded, and your efforts are both inspired and effective.",
    "Saturn Sextile Neptune": "You have opportunities to manifest your idealistic visions through disciplined effort. This aspect supports practical application of compassionate or artistic goals.",

    "Saturn Conjunction Pluto": "Your discipline and ambition are combined with intense focus and transformative power. You are capable of profound achievements through perseverance and a willingness to rebuild structures from the ground up.",
    "Saturn Opposition Pluto": "Your desire for control and structure may lead to intense power struggles or confrontations with overwhelming forces. You need to learn to yield and transform rather than rigidly resist deep changes.",
    "Saturn Square Pluto": "Your adherence to established structures can create intense tension with forces of profound transformation or societal upheaval. This dynamic compels you to confront deep-seated issues of power and control.",
    "Saturn Trine Pluto": "You possess a natural ability to wield power responsibly and facilitate profound, lasting change through disciplined effort. Your structural approach is enhanced by transformative insight.",
    "Saturn Sextile Pluto": "You have opportunities to use your discipline and authority for significant, positive transformation. This aspect supports rebuilding structures with integrity and achieving profound, lasting results.",

    "Uranus Conjunction Neptune": "This rare generational aspect signifies a period of revolutionary spiritual and intuitive breakthroughs. It marks a time of collective awakening and blurring of traditional boundaries.",
    "Uranus Opposition Neptune": "This generational aspect creates tension between revolutionary change and spiritual disillusionment. It can lead to a struggle between breaking free and seeking mystical unity.",
    "Uranus Square Neptune": "This generational aspect creates dynamic tension between innovation and idealism, pushing society to confront illusions. It can lead to breakthroughs that challenge established spiritual or social norms.",
    "Uranus Trine Neptune": "This generational aspect signifies a harmonious flow between innovation and spirituality. It supports intuitive breakthroughs and a collective awakening to new possibilities.",
    "Uranus Sextile Neptune": "This generational aspect offers opportunities for innovative spiritual and intuitive development. It supports collective awakening and a harmonious blending of technology and compassion.",

    "Uranus Conjunction Pluto": "This rare generational aspect signifies profound societal transformation through revolutionary change. It marks a period of intense upheaval and the dismantling of old structures.",
    "Uranus Opposition Pluto": "This generational aspect creates intense tension between revolutionary change and deep transformation. It can lead to power struggles and radical shifts in society.",
    "Uranus Square Pluto": "This generational aspect creates dynamic tension between innovation and profound transformation, pushing society to confront deep-seated issues. It can lead to radical shifts and power struggles.",
    "Uranus Trine Pluto": "This generational aspect signifies a harmonious flow between revolutionary change and deep transformation. It supports societal evolution and the peaceful dismantling of old structures.",
    "Uranus Sextile Pluto": "This generational aspect offers opportunities for revolutionary transformation and collective empowerment. It supports innovative changes that lead to profound societal shifts.",

    "Neptune Conjunction Pluto": "This extremely rare generational aspect signifies a period of profound spiritual and societal transformation. It marks a time of collective awakening and the dissolution of old power structures.",
    "Neptune Opposition Pluto": "This generational aspect creates intense tension between spiritual idealism and deep transformation. It can lead to a struggle between illusion and reality, and profound societal shifts.",
    "Neptune Square Pluto": "This generational aspect creates dynamic tension between idealism and profound transformation, pushing society to confront hidden truths. It can lead to disillusionment that forces deep change.",
    "Neptune Trine Pluto": "This generational aspect signifies a harmonious flow between spiritual awakening and deep transformation. It supports collective healing and the peaceful evolution of consciousness.",
    "Neptune Sextile Pluto": "This generational aspect offers opportunities for spiritual transformation and collective empowerment. It supports intuitive insights that lead to profound societal shifts."
  }
}